app/Controllers/UserController.php

    public function viewUser()
    {
        $page=$this->request->getGet('pages');
        $model = new \App\Models\UserModel();
        $data = [
            'user' => $model->viewUser($page),
            'user1'=> $model->paginate(10 ,'pages'),
            'pager' => $model->pager,
        ];
---
SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT *
FROM `users`
 LIMIT 10, 10

    public function viewUserSuccess()
    {
        $page=$this->request->getGet('pages');
        $model = new \App\Models\UserModel();
        $data = [
            'user' => $model->viewUserSuccess($page),
            'user1'=> $model->paginate(10 ,'pages'),
            'pager' => $model->pager,
        ];
---
SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`

    public function viewAllUser()
    {
        $page=$this->request->getGet('pages');
        $model = new \App\Models\UserModel();
        $data = [
            'user' => $model->viewAllUser($page),
            'user1'=> $model->paginate(10 ,'pages'),
            'pager' => $model->pager,
        ];
---
SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`