app/Controllers/UserController.php

    public function updateStatusFail($userId)
    {
        $status = "2";
        $data = [
            'statusUser' => $status
        ];
        $Usermodel = new UserModel();
        $Usermodel->where('userId', $userId)->set($data)->update();
---
UPDATE `users` SET `statusUser` = '1'
WHERE `userId` = '31'