app/Models/CategoryModel.php

SELECT *
FROM `category`
ORDER BY `categoryId` ASC
---
    public function showCategory()
    {
        $data = $this->orderby('categoryId', 'ASC')->findAll();