app/Models/OfficerModel.php

SELECT *
FROM `officer`
ORDER BY `offId` ASC
---
    public function viewAdmin()
    {
        $data = $this->orderBy('offId', 'ASC')->findAll();