app/Models/ParticModel.php

    public function viewProfilePartic()
    {
        return $this->db->table('participate')
        ->join('users','participate.userId_user = users.userId')
        ->orderBy('partId','ASC' )
        ->where('statusPart','1')
        ->get()->getResultArray();
---
SELECT *
FROM `participate`
JOIN `users` ON `participate`.`userId_user` = `users`.`userId`
WHERE `statusPart` = '1'
ORDER BY `partId` ASC