app/Models/PostModel.php

SELECT *
FROM `post`
JOIN `provinces` ON `post`.`province` = `provinces`.`id`
JOIN `users` ON `post`.`userId` = `users`.`userId`
ORDER BY `postId` DESC
---
    public function viewPost()
    {
        return $this->db->table('post')
        ->join('provinces','post.province = provinces.id')
        ->join('users','post.userId = users.userId')
        ->orderBy('postId','DESC' )
        ->get()->getResultArray();

SELECT *
FROM `post`
JOIN `provinces` ON `post`.`province` = `provinces`.`id`
JOIN `users` ON `post`.`userId` = `users`.`userId`
WHERE `statusPost` = '1'
ORDER BY `postId` DESC
---
    public function viewPostOpen()
    {
        return $this->db->table('post')
        ->join('provinces','post.province = provinces.id')
        ->join('users','post.userId = users.userId')
        ->orderBy('postId','DESC' )
        ->where('statusPost','1')
        ->get()->getResultArray();

SELECT *
FROM `post`
JOIN `provinces` ON `post`.`province` = `provinces`.`id`
JOIN `users` ON `post`.`userId` = `users`.`userId`
WHERE `statusPost` = '0'
ORDER BY `postId` DESC
---
    public function viewPostClose()
    {
        return $this->db->table('post')
        ->join('provinces','post.province = provinces.id')
        ->join('users','post.userId = users.userId')
        ->orderBy('postId','DESC' )
        ->where('statusPost','0')
        ->get()->getResultArray();