app/Models/ReportModel.php

SELECT `report`.`postId`, `report`.`reportId`, `report`.`reportTitle`, `report`.`reportDetail`, `users`.`FName`, `users`.`LName`, `post`.`imagePost`, `users`.`userImage`, `users`.`FName`, `users`.`LName`, `post`.`postTitle`, `post`.`date_start`, `post`.`date_end`, `name_category`, `detailPost`, `num_people`, `expenses`, `name_th`, `name_th_am`, `name_th_dis`, `note`
FROM `report`
JOIN `users` ON `report`.`userId` = `users`.`userId`
JOIN `post` ON `report`.`postId` = `post`.`postId`
JOIN `category` ON `post`.`categoryId` = `category`.`categoryId`
JOIN `provinces` ON `post`.`province` = `provinces`.`id`
JOIN `amphures` ON `post`.`district` = `amphures`.`id`
JOIN `districts` ON `post`.`subDistrict` = `districts`.`id`
ORDER BY `reportId` ASC
---
    public function viewReport()
    {
        return $this->db->table('report')
            ->select("report.postId,report.reportId,report.reportTitle,report.reportDetail,users.FName,users.LName,post.imagePost,users.userImage,users.FName,users.LName,post.postTitle,post.date_start,post.date_end,name_category,detailPost,num_people,expenses,name_th,name_th_am,name_th_dis,note")
            ->join('users', 'report.userId = users.userId')
            ->join('post', 'report.postId = post.postId')
            ->join('category', 'post.categoryId = category.categoryId')
            ->join('provinces', 'post.province = provinces.id')
            ->join('amphures', 'post.district = amphures.id')
            ->join('districts', 'post.subDistrict = districts.id')
            ->orderBy('reportId', 'ASC')
            ->get()->getResultArray();