app/Models/ReviewModel.php

SELECT *
FROM `review`
JOIN `users` ON `review`.`userId` = `users`.`userId`
---
    public function viewReview()
    {
        return $this->db->table('review')
        ->join('users','review.userId = users.userId')
        ->get()->getResultArray();