app/Models/UserModel.php

SELECT *
FROM `users`
JOIN `provinces` ON `users`.`province` = `provinces`.`id`
JOIN `amphures` ON `users`.`district` = `amphures`.`id`
JOIN `districts` ON `users`.`subDistrict` = `districts`.`id`
ORDER BY `userId` ASC
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `provinces` ON `users`.`province` = `provinces`.`id`
JOIN `amphures` ON `users`.`district` = `amphures`.`id`
JOIN `districts` ON `users`.`subDistrict` = `districts`.`id`
---
    public function viewUser($page)
    {
        return $this->select()
            ->join('provinces', 'users.province = provinces.id')
            ->join('amphures', 'users.district = amphures.id')
            ->join('districts', 'users.subDistrict = districts.id')
            ->orderBy('userId', "ASC")
            ->paginate(10, 'pages', $page);