app/Models/UserModel.php

    public function viewUser()
    {
        $data = $this->orderBy('userId', "ASC")->findAll();
---
SELECT *
FROM `users`
ORDER BY `userId` ASC

    public function viewUserSuccess()
    {
        $data = $this->where('statusUser', "1")->findAll();
---
SELECT *
FROM `users`
WHERE `statusUser` = '1'